modules/Hotel/Models/Hotel.php

    public function hasWishList()
    {
        return $this->hasOne($this->userWishListClass, 'object_id', 'id')->where('object_model', $this->type)->where('user_id', Auth::id() ?? 0);
---
select * from `user_wishlist` where `user_wishlist`.`object_id` = 9 and `user_wishlist`.`object_id` is not null and `object_model` = 'hotel' and `user_id` = 1 limit 1