modules/Hotel/Blocks/ListHotel.php

    public function query($model){
        $model_hotel = Hotel::select("bravo_hotels.*")->with(['location','translations','hasWishList']);
        if(empty($model['order'])) $model['order'] = "id";
        if(empty($model['order_by'])) $model['order_by'] = "desc";
        if(empty($model['number'])) $model['number'] = 5;
        if (!empty($model['location_id'])) {
            $location = Location::where('id', $model['location_id'])->where("status","publish")->first();
            if(!empty($location)){
                $model_hotel->join('bravo_locations', function ($join) use ($location) {
                    $join->on('bravo_locations.id', '=', 'bravo_hotels.location_id')
                        ->where('bravo_locations._lft', '>=', $location->_lft)
                        ->where('bravo_locations._rgt', '<=', $location->_rgt);
                });
            }
        }

        if(!empty($model['is_featured']))
        {
            $model_hotel->where('is_featured',1);
        }

        $model_hotel->orderBy("bravo_hotels.".$model['order'], $model['order_by']);
        $model_hotel->where("bravo_hotels.status", "publish");
        $model_hotel->with('location');
        $model_hotel->groupBy("bravo_hotels.id");
        return $model_hotel->limit($model['number'])->get();
---
select * from `bravo_locations` where `bravo_locations`.`id` in (1) and `bravo_locations`.`deleted_at` is null
select `bravo_hotels`.* from `bravo_hotels` where `bravo_hotels`.`status` = 'publish' and `bravo_hotels`.`deleted_at` is null group by `bravo_hotels`.`id` order by `bravo_hotels`.`id` asc limit 4