modules/Language/Models/Language.php

select * from `core_languages` where `status` = 'publish' and `core_languages`.`deleted_at` is null order by CASE WHEN (locale = 'en') THEN 0 ELSE 1 END
---
    public static function getActive($withCurrent = true)
    {
        $value = Language::where('status', 'publish')
                ->orderByRaw('CASE WHEN (locale = \''.e(setting_item('site_locale')).'\') THEN 0 ELSE 1 END')
                ->get();