modules/Tour/Models/Tour.php

    public function getNumberServiceInLocation($location)
    {
        $number = 0;
        if (!empty($location)) {
            $number = parent::join('bravo_locations', function ($join) use ($location) {
                $join->on('bravo_locations.id', '=', 'bravo_tours.location_id')->where('bravo_locations._lft', '>=', $location->_lft)->where('bravo_locations._rgt', '<=', $location->_rgt);
            })->where("bravo_tours.status", "publish")->with(['translations'])->count("bravo_tours.id");
---
select count(`bravo_tours`.`id`) as aggregate from `bravo_tours` inner join `bravo_locations` on `bravo_locations`.`id` = `bravo_tours`.`location_id` and `bravo_locations`.`_lft` >= 1 and `bravo_locations`.`_rgt` <= 2 where `bravo_tours`.`status` = 'publish' and `bravo_tours`.`deleted_at` is null

    public function hasWishList()
    {
        return $this->hasOne($this->userWishListClass, 'object_id', 'id')->where('object_model', $this->type)->where('user_id', Auth::id() ?? 0);
---
select * from `user_wishlist` where `user_wishlist`.`object_id` = 16 and `user_wishlist`.`object_id` is not null and `object_model` = 'tour' and `user_id` = 1 limit 1