modules/Car/Admin/CarController.php

    public function index(Request $request)
    {
        $this->checkPermission('car_view');
        $query = $this->car::query() ;
        $query->orderBy('id', 'desc');
        if (!empty($s = $request->input('s'))) {
            $query->where('title', 'LIKE', '%' . $s . '%');
            $query->orderBy('title', 'asc');
        }

        if ($this->hasPermission('car_manage_others')) {
            if (!empty($author = $request->input('vendor_id'))) {
                $query->where('create_user', $author);
            }
        } else {
            $query->where('create_user', Auth::id());
        }
        $data = [
            'rows'               => $query->with(['author'])->paginate(20),
            'car_manage_others' => $this->hasPermission('car_manage_others'),
            'breadcrumbs'        => [
                [
                    'name' => __('Cars'),
                    'url'  => 'admin/module/tour'
                ],
                [
                    'name'  => __('All'),
                    'class' => 'active'
                ],
            ],
            'page_title'=>__("Car Management")
        ];
---
select * from `users` where `users`.`id` in (1, 4, 5, 6) and `users`.`deleted_at` is null