modules/Space/Blocks/ListSpace.php

    public function query($model){
        $model_space = Space::select("bravo_spaces.*")->with(['location','translations','hasWishList']);
        if(empty($model['order'])) $model['order'] = "id";
        if(empty($model['order_by'])) $model['order_by'] = "desc";
        if(empty($model['number'])) $model['number'] = 5;
        if (!empty($model['location_id'])) {
            $location = Location::where('id', $model['location_id'])->where("status","publish")->first();
            if(!empty($location)){
                $model_space->join('bravo_locations', function ($join) use ($location) {
                    $join->on('bravo_locations.id', '=', 'bravo_spaces.location_id')
                        ->where('bravo_locations._lft', '>=', $location->_lft)
                        ->where('bravo_locations._rgt', '<=', $location->_rgt);
                });
            }
        }

        if(!empty($model['is_featured']))
        {
            $model_space->where('is_featured',1);
        }

        $model_space->orderBy("bravo_spaces.".$model['order'], $model['order_by']);
        $model_space->where("bravo_spaces.status", "publish");
        $model_space->with('location');
        $model_space->groupBy("bravo_spaces.id");
        return $model_space->limit($model['number'])->get();
---
select * from `bravo_locations` where `bravo_locations`.`id` in (1) and `bravo_locations`.`deleted_at` is null
select `bravo_spaces`.* from `bravo_spaces` where `bravo_spaces`.`status` = 'publish' and `bravo_spaces`.`deleted_at` is null group by `bravo_spaces`.`id` order by `bravo_spaces`.`id` desc limit 4