modules/User/Controllers/UserWishListController.php

    public function index(Request $request){
        $wishlist = $this->userWishListClass::query()
            ->where("user_wishlist.user_id",Auth::id())
            ->orderBy('user_wishlist.id', 'desc');
        $data = [
            'rows' => $wishlist->paginate(5),
            'breadcrumbs'        => [
                [
                    'name'  => __('Wishlist'),
                    'class' => 'active'
                ],
            ],
            'page_title'         => __("Wishlist"),
        ];
---
select * from `user_wishlist` where `user_wishlist`.`user_id` = 1 order by `user_wishlist`.`id` desc limit 5 offset 0
select count(*) as aggregate from `user_wishlist` where `user_wishlist`.`user_id` = 1