modules/Activity/Admin/ActivityController.php

    public function index(Request $request)
    {
        $this->checkPermission('activity_view');
        $query = $this->activityClass::query() ;
        $query->orderBy('id', 'desc');
        if (!empty($activity_name = $request->input('s'))) {
            $query->where('title', 'LIKE', '%' . $activity_name . '%');
            $query->orderBy('title', 'asc');
        }
        if (!empty($cate = $request->input('cate_id'))) {
            $query->where('category_id', $cate);
        }
        if ($this->hasPermission('activity_manage_others')) {
            if (!empty($author = $request->input('vendor_id'))) {
                $query->where('create_user', $author);
            }
        } else {
            $query->where('create_user', Auth::id());
        }
        $data = [
            'rows'               => $query->with(['getAuthor','category_activity'])->paginate(20),
            'activity_categories'    => $this->activityCategoryClass::where('status', 'publish')->get()->toTree(),
---
select * from `bravo_activity_category` where `status` = 'publish' and `bravo_activity_category`.`deleted_at` is null