modules/Core/Models/Settings.php

select * from `core_settings`
---
    public static function getSettings($group = '',$locale = '')
    {
        if ($group) {
            static::where('group', $group);
        }
        $all = static::all();

select * from `core_settings`
select * from `core_settings` where `name` = 'car_enable_review' limit 1
---
    public static function item($item, $default = false)
    {
        $value = Cache::rememberForever('setting_' . $item, function () use ($item ,$default) {
            $val = Settings::where('name', $item)->first();
            return ($val and $val['val'] != null) ? $val['val'] : $default;
        });