modules/News/Admin/NewsController.php

select * from `core_news_category` where `core_news_category`.`id` in (1, 2, 3, 4) and `core_news_category`.`deleted_at` is null
select * from `core_news` where (IFNULL(lang,'') = ''  or `lang` = 'en') and `core_news`.`deleted_at` is null order by `id` desc limit 20 offset 0
select count(*) as aggregate from `core_news` where (IFNULL(lang,'') = ''  or `lang` = 'en') and `core_news`.`deleted_at` is null
---
    public function index(Request $request)
    {
        $this->checkPermission('news_view');
        $dataNews = News::query()->orderBy('id', 'desc');
        $post_name = $request->query('s');
        $cate = $request->query('cate_id');
        if ($cate) {
           $dataNews->where('cat_id', $cate);
        }
        if ($post_name) {
            $dataNews->where('title', 'LIKE', '%' . $post_name . '%');
            $dataNews->orderBy('title', 'asc');
        }


        $this->filterLang($dataNews);

        $data = [
            'rows'        => $dataNews->with("getAuthor")->with("getCategory")->paginate(20),
            'categories'  => NewsCategory::get(),
            'breadcrumbs' => [
                [
                    'name' => __('News'),
                    'url'  => 'admin/module/news'
                ],
                [
                    'name'  => __('All'),
                    'class' => 'active'
                ],
            ],
            "languages"=>Language::getActive(false),
            "locale"=>\App::getLocale(),
            'page_title'=>__("News Management")
        ];