modules/Event/Blocks/ListEvent.php

    public function query($model){
        $model_event = Event::select("bravo_events.*")->with(['location','translations','hasWishList']);
        if(empty($model['order'])) $model['order'] = "id";
        if(empty($model['order_by'])) $model['order_by'] = "desc";
        if(empty($model['number'])) $model['number'] = 5;
        if (!empty($model['location_id'])) {
            $location = Location::where('id', $model['location_id'])->where("status","publish")->first();
            if(!empty($location)){
                $model_event->join('bravo_locations', function ($join) use ($location) {
                    $join->on('bravo_locations.id', '=', 'bravo_events.location_id')
                        ->where('bravo_locations._lft', '>=', $location->_lft)
                        ->where('bravo_locations._rgt', '<=', $location->_rgt);
                });
            }
        }

        if(!empty($model['is_featured']))
        {
            $model_event->where('is_featured',1);
        }

        $model_event->orderBy("bravo_events.".$model['order'], $model['order_by']);
        $model_event->where("bravo_events.status", "publish");
        $model_event->with('location');
        $model_event->groupBy("bravo_events.id");
        return $model_event->limit($model['number'])->get();
---
select * from `bravo_locations` where `bravo_locations`.`id` in (4, 5, 6, 7) and `bravo_locations`.`deleted_at` is null
select `bravo_events`.* from `bravo_events` where `bravo_events`.`status` = 'publish' and `bravo_events`.`deleted_at` is null group by `bravo_events`.`id` order by `bravo_events`.`id` desc limit 4