modules/Core/Admin/SettingsController.php

select * from `core_settings` where `name` = 'map_provider' limit 1
---
                foreach ($keys as $key) {
                    $setting_key = $key.($lang ? '_'.$lang : '');

                    $check = Settings::where('name', $setting_key)->first();